from random import *


def choice(answer):
    return answer[randint(0, 19)]


answers = ["Бесспорно", "Предрешено", "Никаких сомнений", "Определённо да", "Можешь быть уверен в этом", "Мне кажется - да", "Вероятнее всего", "Хорошие перспективы", "Знаки говорят - да", "Да", "Пока неясно, попробуй снова", "Спроси позже", "Лучше не рассказывать", "Сейчас нельзя предсказать", "Сконцентрируйся и спроси опять", "Даже не думай", "Мой ответ - нет", "По моим данным - нет", "Перспективы не очень хорошие", "Весьма сомнительно"]

print("Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.")
name = input("Как вас зовут? ")
print(f"Привет {name}!")

while True:
    print("Ты пришел ко мне с вопросом, ибо будущее твое туманно. Задай же вопрос и получишь ответ.")
    input()
    print(choice(answers))
    want = input('Если хочешь задать еще вопрос - напиши "Да" ')
    if want.lower() != "да":
        print("Возвращайся если возникнут вопросы! У-ха-ха-ха")
        break